app/Controllers/HotelController.php

SELECT `hotel`.*, COUNT(like_hotel.`hotelCode`) AS 'like', COUNT(comment_hotel.`hotelCode`) AS 'comment'
FROM `hotel`
LEFT JOIN `like_hotel` ON like_hotel.`hotelCode`=hotel.`hotelCode`
LEFT JOIN `comment_hotel` ON like_hotel.`hotelCode`= comment_hotel.`hotelCode`
WHERE `hotel`.`stateCode` = '1'
AND `hotel`.`deleteAt` IS NULL
GROUP BY `hotel`.`hotelCode`
---
    public function show($id = null)
    {
        $hotel = $this->model->select("hotel.*, COUNT(like_hotel.`hotelCode`) AS 'like', COUNT(comment_hotel.`hotelCode`) AS 'comment'")->join("like_hotel", "like_hotel.`hotelCode`=hotel.`hotelCode`", "left")->join("comment_hotel", "like_hotel.`hotelCode`= comment_hotel.`hotelCode`", "left")->groupBy("hotel.`hotelCode`")->where(['hotel.stateCode' => $id])->findAll();