app/Controllers/TourController.php

    public function update($id = null)
    {
        $validasi = $this->validate([
            'name' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Nama Objek Wisata Harus di isi'
                ],
            ],
            'stateCode' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kabupaten Objek Wisata Harus di isi'
                ],
            ],
        ]);
        if ($validasi) {
            $data = (array) $this->request->getVar();
            $this->model->update(['tourCode' => $id], $data);
---
UPDATE `tour` SET `name` = 'Lampung Walks', `stateCode` = 1, `updateAt` = '2022-09-19 17:06:32'
WHERE `tour`.`tourCode` IN ('2')

    public function recomendedTour($limit = 0)
    {
        $tours = $this->model->select("tour.*, COUNT(like_tour.`tourCode`) AS 'like', COUNT(comment_tour.`tourCode`) AS 'comment'")->join("like_tour", "like_tour.`tourCode`=tour.`tourCode`", "left")->join("comment_tour", "like_tour.`tourCode`= comment_tour.`tourCode`", "left")->groupBy("tour.`tourCode`")->limit($limit)->orderBy("comment", "DESC")->findAll($limit);
---
SELECT `tour`.*, COUNT(like_tour.`tourCode`) AS 'like', COUNT(comment_tour.`tourCode`) AS 'comment'
FROM `tour`
LEFT JOIN `like_tour` ON like_tour.`tourCode`=tour.`tourCode`
LEFT JOIN `comment_tour` ON like_tour.`tourCode`= comment_tour.`tourCode`
WHERE `tour`.`deleteAt` IS NULL
GROUP BY `tour`.`tourCode`
ORDER BY `comment` DESC